memtier/energy/data/pi4/strong.out
4         Threads
50        Connections per thread
320000    Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         2856.26          ---          ---         6.53386         5.15100        21.11900        27.51900       194.94 
Gets        28562.46        62.52     28499.94         6.51855         5.15100        21.11900        27.51900       725.89 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      31418.72        62.52     28499.94         6.51994         5.15100        21.11900        27.51900       920.82 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.151        0.000
SET       1.975        5.000
SET       2.399       10.000
SET       2.831       15.000
SET       3.071       20.000
SET       3.455       25.000
SET       3.807       30.000
SET       4.079       35.000
SET       4.479       40.000
SET       4.831       45.000
SET       5.151       50.000
SET       5.343       52.500
SET       5.567       55.000
SET       5.855       57.500
SET       6.111       60.000
SET       6.335       62.500
SET       6.687       65.000
SET       7.039       67.500
SET       7.359       70.000
SET       7.871       72.500
SET       8.383       75.000
SET       8.703       76.250
SET       9.023       77.500
SET       9.343       78.750
SET       9.727       80.000
SET      10.047       81.250
SET      10.431       82.500
SET      10.815       83.750
SET      11.199       85.000
SET      11.647       86.250
SET      12.095       87.500
SET      12.351       88.125
SET      12.607       88.750
SET      12.863       89.375
SET      13.119       90.000
SET      13.439       90.625
SET      13.695       91.250
SET      14.015       91.875
SET      14.335       92.500
SET      14.591       93.125
SET      14.847       93.750
SET      14.975       94.062
SET      15.167       94.375
SET      15.295       94.688
SET      15.423       95.000
SET      15.615       95.312
SET      15.743       95.625
SET      15.935       95.938
SET      16.127       96.250
SET      16.383       96.562
SET      16.639       96.875
SET      16.895       97.031
SET      17.023       97.188
SET      17.279       97.344
SET      17.407       97.500
SET      17.791       97.656
SET      18.047       97.812
SET      18.431       97.969
SET      18.687       98.125
SET      19.071       98.281
SET      19.327       98.438
SET      19.583       98.516
SET      19.711       98.594
SET      19.967       98.672
SET      20.223       98.750
SET      20.479       98.828
SET      20.735       98.906
SET      21.119       98.984
SET      21.375       99.062
SET      21.759       99.141
SET      22.143       99.219
SET      22.271       99.258
SET      22.527       99.297
SET      22.655       99.336
SET      22.911       99.375
SET      23.039       99.414
SET      23.295       99.453
SET      23.423       99.492
SET      23.679       99.531
SET      23.935       99.570
SET      24.191       99.609
SET      24.319       99.629
SET      24.447       99.648
SET      24.575       99.668
SET      24.831       99.688
SET      24.959       99.707
SET      25.087       99.727
SET      25.343       99.746
SET      25.471       99.766
SET      25.727       99.785
SET      25.983       99.805
SET      26.111       99.814
SET      26.239       99.824
SET      26.367       99.834
SET      26.495       99.844
SET      26.623       99.854
SET      26.751       99.863
SET      26.879       99.873
SET      27.135       99.883
SET      27.263       99.893
SET      27.519       99.902
SET      27.647       99.907
SET      27.903       99.912
SET      28.031       99.917
SET      28.159       99.922
SET      28.287       99.927
SET      28.543       99.932
SET      28.671       99.937
SET      28.927       99.941
SET      29.311       99.946
SET      29.695       99.951
SET      29.823       99.954
SET      29.951       99.956
SET      30.207       99.958
SET      30.463       99.961
SET      30.591       99.963
SET      30.847       99.966
SET      31.231       99.968
SET      31.615       99.971
SET      31.871       99.973
SET      32.383       99.976
SET      32.639       99.977
SET      33.023       99.978
SET      33.279       99.979
SET      33.535       99.980
SET      34.047       99.982
SET      34.303       99.983
SET      34.815       99.984
SET      35.071       99.985
SET      35.327       99.987
SET      35.839       99.988
SET      35.839       99.988
SET      36.095       99.989
SET      36.351       99.990
SET      36.351       99.990
SET      36.607       99.991
SET      36.863       99.991
SET      36.863       99.992
SET      37.119       99.993
SET      37.375       99.993
SET      37.631       99.994
SET      37.631       99.994
SET      37.887       99.995
SET      37.887       99.995
SET      37.887       99.995
SET      38.143       99.995
SET      38.399       99.996
SET      38.655       99.996
SET      38.655       99.996
SET      38.911       99.997
SET      39.423       99.997
SET      40.447       99.997
SET      40.703       99.997
SET      40.959       99.997
SET      41.215       99.998
SET      41.727       99.998
SET      41.983       99.998
SET      42.495       99.998
SET      43.007       99.998
SET      43.519       99.998
SET      43.775       99.998
SET      44.031       99.999
SET      44.287       99.999
SET      44.543       99.999
SET      44.799       99.999
SET      45.055       99.999
SET      45.567       99.999
SET      45.823       99.999
SET      46.079       99.999
SET      46.335       99.999
SET      46.847       99.999
SET      47.103       99.999
SET      47.359       99.999
SET      47.615       99.999
SET      47.615       99.999
SET      47.871       99.999
SET      48.127       99.999
SET      48.383      100.000
SET      48.895      100.000
SET      48.895      100.000
SET      48.895      100.000
[...]
SET      49.151      100.000
SET      49.151      100.000
SET      49.663      100.000
SET      49.919      100.000
SET      49.919      100.000
SET      50.175      100.000
SET      50.175      100.000
SET      50.431      100.000
SET      52.991      100.000
SET      52.991      100.000
SET      53.503      100.000
SET      53.503      100.000
SET      53.759      100.000
SET      53.759      100.000
SET      53.759      100.000
[...]
SET      54.015      100.000
SET      54.015      100.000
SET      55.039      100.000
SET      55.039      100.000
SET      55.039      100.000
[...]
SET      58.367      100.000
SET      58.367      100.000
SET      58.367      100.000
[...]
SET      59.135      100.000
SET      59.135      100.000
SET      59.135      100.000
[...]
SET      61.695      100.000
SET      61.695      100.000
SET      61.695      100.000
[...]
SET      63.231      100.000
SET      63.231      100.000
---
GET       0.143        0.000
GET       1.959        5.000
GET       2.383       10.000
GET       2.815       15.000
GET       3.071       20.000
GET       3.439       25.000
GET       3.791       30.000
GET       4.063       35.000
GET       4.447       40.000
GET       4.831       45.000
GET       5.151       50.000
GET       5.311       52.500
GET       5.535       55.000
GET       5.823       57.500
GET       6.079       60.000
GET       6.303       62.500
GET       6.655       65.000
GET       7.039       67.500
GET       7.327       70.000
GET       7.839       72.500
GET       8.319       75.000
GET       8.639       76.250
GET       8.959       77.500
GET       9.279       78.750
GET       9.663       80.000
GET      10.047       81.250
GET      10.367       82.500
GET      10.815       83.750
GET      11.199       85.000
GET      11.647       86.250
GET      12.095       87.500
GET      12.287       88.125
GET      12.543       88.750
GET      12.863       89.375
GET      13.119       90.000
GET      13.375       90.625
GET      13.695       91.250
GET      14.015       91.875
GET      14.271       92.500
GET      14.591       93.125
GET      14.847       93.750
GET      14.975       94.062
GET      15.103       94.375
GET      15.295       94.688
GET      15.423       95.000
GET      15.551       95.312
GET      15.743       95.625
GET      15.935       95.938
GET      16.127       96.250
GET      16.319       96.562
GET      16.639       96.875
GET      16.895       97.031
GET      17.023       97.188
GET      17.151       97.344
GET      17.407       97.500
GET      17.663       97.656
GET      18.047       97.812
GET      18.303       97.969
GET      18.687       98.125
GET      18.943       98.281
GET      19.327       98.438
GET      19.583       98.516
GET      19.711       98.594
GET      19.967       98.672
GET      20.223       98.750
GET      20.479       98.828
GET      20.735       98.906
GET      20.991       98.984
GET      21.375       99.062
GET      21.759       99.141
GET      22.143       99.219
GET      22.271       99.258
GET      22.527       99.297
GET      22.655       99.336
GET      22.911       99.375
GET      23.039       99.414
GET      23.295       99.453
GET      23.423       99.492
GET      23.679       99.531
GET      23.935       99.570
GET      24.191       99.609
GET      24.319       99.629
GET      24.447       99.648
GET      24.575       99.668
GET      24.703       99.688
GET      24.959       99.707
GET      25.087       99.727
GET      25.215       99.746
GET      25.471       99.766
GET      25.727       99.785
GET      25.855       99.805
GET      25.983       99.814
GET      26.111       99.824
GET      26.239       99.834
GET      26.495       99.844
GET      26.623       99.854
GET      26.751       99.863
GET      26.879       99.873
GET      27.135       99.883
GET      27.263       99.893
GET      27.519       99.902
GET      27.647       99.907
GET      27.775       99.912
GET      27.903       99.917
GET      28.159       99.922
GET      28.287       99.927
GET      28.543       99.932
GET      28.671       99.937
GET      28.927       99.941
GET      29.183       99.946
GET      29.567       99.951
GET      29.695       99.954
GET      29.951       99.956
GET      30.079       99.958
GET      30.335       99.961
GET      30.591       99.963
GET      30.847       99.966
GET      31.103       99.968
GET      31.359       99.971
GET      31.743       99.973
GET      32.127       99.976
GET      32.383       99.977
GET      32.639       99.978
GET      33.023       99.979
GET      33.279       99.980
GET      33.535       99.982
GET      34.047       99.983
GET      34.303       99.984
GET      34.559       99.985
GET      35.071       99.987
GET      35.327       99.988
GET      35.583       99.988
GET      35.839       99.989
GET      35.839       99.990
GET      36.095       99.990
GET      36.351       99.991
GET      36.607       99.991
GET      36.607       99.992
GET      36.863       99.993
GET      37.119       99.993
GET      37.375       99.994
GET      37.631       99.994
GET      37.631       99.995
GET      37.887       99.995
GET      37.887       99.995
GET      38.143       99.995
GET      38.143       99.996
GET      38.399       99.996
GET      38.655       99.996
GET      38.911       99.997
GET      39.167       99.997
GET      39.423       99.997
GET      39.935       99.997
GET      40.191       99.997
GET      40.703       99.998
GET      40.959       99.998
GET      41.471       99.998
GET      41.983       99.998
GET      42.495       99.998
GET      43.007       99.998
GET      43.519       99.998
GET      43.775       99.999
GET      44.031       99.999
GET      44.543       99.999
GET      44.799       99.999
GET      45.055       99.999
GET      45.567       99.999
GET      46.079       99.999
GET      46.335       99.999
GET      46.847       99.999
GET      47.359       99.999
GET      47.615       99.999
GET      47.871       99.999
GET      48.127       99.999
GET      48.383       99.999
GET      48.895       99.999
GET      49.151       99.999
GET      49.407      100.000
GET      49.919      100.000
GET      50.175      100.000
GET      50.687      100.000
GET      50.943      100.000
GET      50.943      100.000
GET      51.455      100.000
GET      51.967      100.000
GET      52.479      100.000
GET      52.991      100.000
GET      53.247      100.000
GET      53.503      100.000
GET      53.503      100.000
GET      53.759      100.000
GET      53.759      100.000
GET      53.759      100.000
GET      54.015      100.000
GET      54.015      100.000
GET      54.527      100.000
GET      54.527      100.000
GET      54.527      100.000
GET      54.783      100.000
GET      55.295      100.000
GET      55.807      100.000
GET      55.807      100.000
GET      56.063      100.000
GET      56.319      100.000
GET      56.575      100.000
GET      56.831      100.000
GET      57.087      100.000
GET      57.343      100.000
GET      57.599      100.000
GET      58.111      100.000
GET      58.367      100.000
GET      58.367      100.000
GET      58.623      100.000
GET      58.623      100.000
GET      58.623      100.000
GET      59.135      100.000
GET      59.135      100.000
GET      59.135      100.000
GET      59.647      100.000
GET      59.647      100.000
GET      60.671      100.000
GET      60.671      100.000
GET      60.927      100.000
GET      61.439      100.000
GET      61.439      100.000
GET      61.695      100.000
GET      61.695      100.000
GET      61.695      100.000
GET      62.207      100.000
GET      62.207      100.000
GET      62.719      100.000
GET      62.719      100.000
GET      62.719      100.000
GET      63.231      100.000
GET      63.231      100.000
GET      63.231      100.000
[...]
GET      63.487      100.000
GET      63.487      100.000
GET      63.487      100.000
[...]
GET      63.743      100.000
GET      63.743      100.000
GET      63.743      100.000
[...]
GET      64.255      100.000
GET      64.255      100.000
---
WAIT      0.000      100.000